dogusyuksel/ti_cc2640r2f_sdk/ccs1281/ccs/ccs_base/common/targetdb/Modules/msp/mspm0gx51x/UART7_1.0.xml
    <register id="UART7_IFLS" width="32" offset="0x110C" description="UART Interrupt FIFO Level Select Register">
        <bitfield id="TXIFLSEL" description="UART Transmit Interrupt FIFO Level Select  The trigger points for the transmit interrupt are as follows: 
Note: for undefined settings the default configuration is used." begin="2" end="0" width="3" rwaccess="R/W">
            <bitenum id="LVL_3_4" value="0x1" description="TX FIFO &lt;= 3/4 empty"/>
            <bitenum id="LVL_1_2" value="0x2" description="TX FIFO &lt;= 1/2 empty (default)"/>
            <bitenum id="LVL_1_4" value="0x3" description="TX FIFO &lt;= 1/4 empty"/>
            <bitenum id="LVL_EMPTY" value="0x5" description="TX FIFO is empty"/>
            <bitenum id="LVL_1" value="0x7" description="TX FIFO &gt;= 1 entry free Note: esp. required for DMA Trigger"/>
        </bitfield>
        <bitfield id="RXIFLSEL" description="UART Receive Interrupt FIFO Level Select  The trigger points for the receive interrupt are as follows: 

Note: 
  In ULP domain the trigger levels are used for:
  0: LVL_1_4
  4: LVL_FULL
  For undefined settings the default configuration is used." begin="6" end="4" width="3" rwaccess="R/W">
            <bitenum id="LVL_1_4_RES" value="0x0" description="RX FIFO &gt;= 1/4 full Note: For ULP Domain"/>
            <bitenum id="LVL_1_4" value="0x1" description="RX FIFO &gt;= 1/4 full"/>
            <bitenum id="LVL_1_2" value="0x2" description="RX FIFO &gt;= 1/2 full (default)"/>
            <bitenum id="LVL_3_4" value="0x3" description="RX FIFO &gt;= 3/4 full"/>
            <bitenum id="LVL_FULL_RES" value="0x4" description="RX FIFO is full Note: For ULP Domain"/>
            <bitenum id="LVL_FULL" value="0x5" description="RX FIFO is full"/>
            <bitenum id="LVL_1" value="0x7" description="RX FIFO &gt;= 1 entry available Note: esp. required for DMA Trigger"/>
        </bitfield>
        <bitfield id="RXTOSEL" description="UART Receive Interrupt Timeout Select. When receiving no start edge for an additional character within the set bittimes a RX interrupt is set even if the FIFO level is not reached. A value of 0 disables this function." begin="11" end="8" width="4" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xF" description="Highest possible value"/>
        </bitfield>
    </register>
    <register id="UART7_IBRD" width="32" offset="0x1110" description="UART Integer Baud-Rate Divisor Register">
        <bitfield id="DIVINT" description="Integer Baud-Rate Divisor" begin="15" end="0" width="16" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xFFFF" description="Highest possible value"/>
        </bitfield>
    </register>
    <register id="UART7_FBRD" width="32" offset="0x1114" description="UART Fractional Baud-Rate Divisor Register">
        <bitfield id="DIVFRAC" description="Fractional Baud-Rate Divisor" begin="5" end="0" width="6" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0x3F" description="Highest possible value"/>
        </bitfield>
    </register>
    <register id="UART7_GFCTL" width="32" offset="0x1118" description="Glitch Filter Control">
        <bitfield id="AGFSEL" description="Analog Glitch Suppression Pulse Width
This field controls the pulse width select for the analog glitch suppression on the RX line.
See device datasheet for exact values." begin="10" end="9" width="2" rwaccess="R/W">
            <bitenum id="AGLIT_5" value="0x0" description="Pulses shorter then 5ns length are filtered."/>
            <bitenum id="AGLIT_10" value="0x1" description="Pulses shorter then 10ns length are filtered."/>
            <bitenum id="AGLIT_25" value="0x2" description="Pulses shorter then 25ns length are filtered."/>
            <bitenum id="AGLIT_50" value="0x3" description="Pulses shorter then 50ns length are filtered."/>
        </bitfield>
        <bitfield id="AGFEN" description="Analog Glitch Suppression Enable" begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Analog Glitch Filter disable"/>
            <bitenum id="ENABLE" value="0x1" description="Analog Glitch Filter enable"/>
        </bitfield>
        <bitfield id="DGFSEL" description="Glitch Suppression Pulse Width 
This field controls the pulse width select for glitch suppression on the RX line. 
The value programmed in this field gives the number of cycles of functional clock up to which the glitch has to be suppressed on the RX line.

In IRDA mode:
The minimum pulse length for receive is given by:
t(MIN) = (DGFSEL) / f(IRTXCLK)" begin="5" end="0" width="6" rwaccess="R/W">
            <bitenum id="DISABLED" value="0x0" description="Bypass GF"/>
            <bitenum id="MAXIMUM" value="0x3F" description="Highest Possible Value"/>
        </bitfield>
        <bitfield id="CHAIN" description="Analog and digital noise filters chaining enable.
        0 DISABLE: When 0, chaining is disabled and only digital filter output is available to IP logic for sampling
        1 ENABLE: When 1, analog and digital glitch filters are chained and the output of the combination is made available to IP logic for sampling" begin="11" end="11" width="1" rwaccess="R/W">
            <bitenum id="DISABLED" value="0x0" description="Disabled"/>
            <bitenum id="ENABLED" value="0x1" description="Enabled"/>
        </bitfield>
    </register>
    <register id="UART7_TXDATA" width="32" offset="0x1120" description="UART Transmit Data Register">
        <bitfield id="DATA" description="Data Transmitted or Received  Data that is to be transmitted via the UART is written to this field.  When read, this field contains the data that was received by the UART." begin="7" end="0" width="8" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xFF" description="Highest possible value"/>
        </bitfield>
    </register>
